# Dictionaries & Pandas

## Dictionaries

In [13]:
countries = ["usa", "china", "russia"]
cou_ind = countries.index("china")
cou_ind

1

In [14]:
capitals = ["Washington", "Pekin", "Moskow"]
d = {
    "country": countries,
    "capital": capitals
}
print(d)
print(d.keys())

{'country': ['usa', 'china', 'russia'], 'capital': ['Washington', 'Pekin', 'Moskow']}
dict_keys(['country', 'capital'])

## Pandas

### Importing

In [15]:
import pandas as pd

### Prepearing Data

In [16]:
my_devices = {
    "IDs": ["0001", "0002", "0003", "0004", "0005"],
    "Devices": ["Macbook", "Iphone", "Mac Mini", "TV", "Ipad"],
    "Charge": [86, 100, None, None, 32]
}
my_devices

{'IDs': ['0001', '0002', '0003', '0004', '0005'],
 'Devices': ['Macbook', 'Iphone', 'Mac Mini', 'TV', 'Ipad'],
 'Charge': [86, 100, None, None, 32]}

### Creating DataFrame

In [17]:
my_devices_pd = pd.DataFrame(my_devices)
my_devices_pd

    IDs   Devices  Charge
0  0001   Macbook    86.0
1  0002    Iphone   100.0
2  0003  Mac Mini     NaN
3  0004        TV     NaN
4  0005      Ipad    32.0

### Setting Row Labels

In [18]:
labels = ["PC", "TP", "PC", "TV", "TA"]
my_devices_pd.index = labels
my_devices_pd

     IDs   Devices  Charge
PC  0001   Macbook    86.0
TP  0002    Iphone   100.0
PC  0003  Mac Mini     NaN
TV  0004        TV     NaN
TA  0005      Ipad    32.0

### Read CSV File

In [22]:
cars = pd.read_csv('cars.csv', index_col=0)
cars

         brand        model  power  price
SU      Subaru     Forester    200  10000
MI  Mitsubishi  Lancher Evo    210  10500
DG       Dodge   Challenger    728  35700
CT   Chevrolet    Camaro SS    527  30000
FD        Ford    "Mustang"    630  33000

### Series

In [25]:
pandas_series = cars["brand"]
pandas_dataframe = cars[["brand"]]
print(pandas_series)
print(pandas_dataframe)

SU        Subaru
MI    Mitsubishi
DG         Dodge
CT     Chevrolet
FD          Ford
Name: brand, dtype: object
         brand
SU      Subaru
MI  Mitsubishi
DG       Dodge
CT   Chevrolet
FD        Ford

### Accesing Data in a DataFrame

In [27]:
brand_price = cars[["brand", "price"]]
brand_price

         brand  price
SU      Subaru  10000
MI  Mitsubishi  10500
DG       Dodge  35700
CT   Chevrolet  30000
FD        Ford  33000

In [28]:
cars[1:4]

         brand        model  power  price
MI  Mitsubishi  Lancher Evo    210  10500
DG       Dodge   Challenger    728  35700
CT   Chevrolet    Camaro SS    527  30000

In [45]:
# loc: label based 
print(cars.loc["DG"])
print("---------------")
print(cars.loc[["FD", "CT", "SU"], ["brand", "price"]])
print("---------------")
print(cars.loc[:, ["brand", "price"]])

brand         Dodge
model    Challenger
power           728
price         35700
Name: DG, dtype: object
---------------
        brand  price
FD       Ford  33000
CT  Chevrolet  30000
SU     Subaru  10000
---------------
         brand  price
SU      Subaru  10000
MI  Mitsubishi  10500
DG       Dodge  35700
CT   Chevrolet  30000
FD        Ford  33000

In [48]:
# iloc: integer-position based
print(cars.iloc[1])
print("---------------")
print(cars.iloc[[1, 2, 3], [1, 2]])
print("---------------")
print(cars.iloc[:, [1, 2]])

brand     Mitsubishi
model    Lancher Evo
power            210
price          10500
Name: MI, dtype: object
---------------
          model  power
MI  Lancher Evo    210
DG   Challenger    728
CT    Camaro SS    527
---------------
          model  power
SU     Forester    200
MI  Lancher Evo    210
DG   Challenger    728
CT    Camaro SS    527
FD    "Mustang"    630